IDEA Open Model
NumberGroups.CreateGroups Method (Double[])
 Creates new instance with groups with with one value in group.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public static NumberGroups CreateGroups(
	params double[] positions
)
Public Shared Function CreateGroups (
	ParamArray positions As Double()
) As NumberGroups
public:
static NumberGroups^ CreateGroups(
	... array<double>^ positions
)
Parameters
positions
Type: System.Double[]
The sequence of numbers to create groups.
Return Value
Type: NumberGroups
A new instance of groups.
See Also
Reference
NumberGroups Class
CreateGroups Overload
IdeaRS.OpenModel.Parameters Namespace